-module(lesson2_task10).
-export([encode/1]).

encode([]) -> [];  % Якщо список порожній, повертаємо порожній список.
encode([X]) -> [{1, X}];  % Якщо список містить лише один елемент, кодуємо його як {1, X}.
encode([X, X | Tail]) ->  % Якщо два перших елемента однакові, рахуємо їх.
    [{Count, X} | Rest] = encode([X | Tail]),
    [{Count + 1, X} | Rest];  % Збільшуємо лічильник і продовжуємо.
encode([X, Y | Tail]) ->  % Якщо елементи різні, записуємо {1, X} і продовжуємо для решти.
    [{1, X} | encode([Y | Tail])].
